{
  "navbar": {
    "links": {
      "home": "Home",
      "aboutMe": "About Me",
      "softSkills": "Soft Skills",
      "techSkills": "Tech Skills",
      "projects": "Projects",
      "contactMe": "Contact Me"
    },
    "languages": {
      "en": "English",
      "es": "Spanish"
    },
    "mode": {
      "system": "System",
      "light": "Light",
      "dark": "Dark"
    }
  },
  "home": {
    "career": "Full-Stack Web Developer",
    "introduction": "I am a full-stack web developer with experience in developing applications using React and Next.js. My focus revolves around building scalable and modern web solutions, leveraging my skills in both frontend and backend development.",
    "contactMe": "Contact Me",
    "donwload": "Download CV"
  },
  "aboutme": {
    "title": "ABOUT ME",
    "description": "Hello! I'm Junior Huanca, a web developer passionate about creating amazing digital experiences. With experience in technologies like Next.js, JavaScript, TypeScript, React, Node.js, and Express, I can build robust and scalable web applications. \nI have skills in working with databases like MongoDB and PostgreSQL, allowing me to efficiently manage data and ensure data integrity. \nAdditionally, I have experience using Git and Bash for version control and task automation, which helps me work more efficiently and ensure smooth project delivery. \nI'm excited to take on new challenges and constantly learn in this evolving field. If you're looking for a passionate and dedicated web developer, feel free to contact me! I'll be delighted to collaborate with you on your next project."
  },
  "softskills": {
    "title": "SOFT SKILLS",
    "description": "As a full stack web developer, I consider my most important soft skills to be:",
    "data": [
      {
        "image": "Comunicacion",
        "title": "Communication",
        "text": "I strive to communicate in a clear and effective manner with clients, colleagues, and superiors to ensure mutual understanding and effective collaboration."
      },
      {
        "image": "Colaboracion",
        "title": "Collaboration",
        "text": "I enjoy working as part of a team and collaborating with other developers, designers, and IT professionals to achieve common goals."
      },
      {
        "image": "Adaptabilidad",
        "title": "Adaptability",
        "text": "I stay up-to-date with the latest technologies and trends in web development and I am willing to learn new skills and technologies to meet the changing requirements of clients."
      },
      {
        "image": "ResolucionProblemas",
        "title": "Problem Solving",
        "text": "I consider myself an analytical thinker and I am willing to find solutions to technical challenges that arise in web development."
      },
      {
        "image": "Liderazgo",
        "title": "Leadership",
        "text": "I strive to be a motivating leader when leading projects or teams, and I aim to foster a collaborative and productive environment."
      },
      {
        "image": "Organizacion",
        "title": "Organization",
        "text": "I enjoy maintaining an overview of my projects and tasks, and I strive to manage my time effectively to achieve my goals and deliver projects on time."
      }
    ]
  },
  "techskills": {
    "title": "TECHNICAL SKILLS",
    "description": "As an experienced web developer, I have a strong knowledge of technologies such as JavaScript, React, Redux, Node.js, Express, Sequelize, HTML, CSS, Next.js, TypeScript, Tailwind, and more. Below, you will find images representing my skills and expertise in these areas."
  },
  "projects": {
    "title": "PROJECTS",
    "description": "Welcome to my Projects section, where you can see my achievements and capabilities as a web developer. Each project includes a detailed description of the tasks I performed, as well as a link for you to view the final result. If you are interested in working with me on your next project, feel free to contact me.",
    "buttons": {
      "watch": "View Project",
      "repository": "Repository"
    },
    "data": [
      {
        "LaDionisia": {
          "description": "An online wine shop with registration and access through email or Google account. Wide selection of wines that can be filtered and sorted. Secure payment with credit card or PayPal. Favorites feature for desired products. Users can save products to their favorites, while administrators have access to a panel for editing and managing products, as well as viewing statistics and registered users. Users can leave reviews and ratings, which can be reported and moderated by administrators."
        }
      },
      {
        "DigitalDreams": {
          "description": "It is an e-commerce website for technology and computer-related products. The goal is to provide a convenient platform for purchasing quality products online. It will include advanced search filters, third-party authentication, and a secure payment gateway. Customers will be able to explore categories, compare products, read reviews, and make secure purchases. Third-party authentication will be provided to facilitate registration and access. In summary, we aim to provide a convenient and secure online shopping experience for technology enthusiasts."
        }
      }
    ]
  }
}
