{
  "metaTags": {
    "title": "Junior Huanca | Full Stack Developer",
    "description": "Desarrollador Full Stack especializado en React, Next.js y TypeScript. Experiencia en despliegues cloud con Azure, automatización CI/CD y desarrollo de aplicaciones web escalables."
  },
  "navbar": {
    "links": {
      "home": "Inicio",
      "aboutMe": "Conóceme",
      "softSkills": "Habilidades blandas",
      "techSkills": "Habilidades técnicas",
      "projects": "Proyectos",
      "contactMe": "Contáctame"
    },
    "languages": {
      "en": "Inglés",
      "es": "Español"
    },
    "mode": {
      "system": "Sistema",
      "light": "Claro",
      "dark": "Oscuro"
    }
  },
  "home": {
    "career": "Desarrollador Web Full-Stack",
    "introduction": "Desarrollador Full Stack especializado en React, Next.js y TypeScript.\nConstruyo aplicaciones web modernas y escalables con enfoque en arquitectura limpia y rendimiento.\nExperiencia en despliegues en la nube con Azure y automatización de procesos mediante CI/CD.\nMe enfoco en crear soluciones robustas listas para producción.",
    "contactMe": "Contáctame",
    "cv": "Conoce mi experiencia"
  },
  "aboutme": {
    "title": "CONÓCEME",
    "description": "Soy Desarrollador Full Stack con experiencia en la creación de aplicaciones web modernas utilizando React, Next.js y TypeScript, diseñando soluciones escalables y mantenibles orientadas a entornos productivos.\n\nHe trabajado con plataformas cloud como Azure App Services y Vercel, gestionando despliegues y configurando procesos de integración y entrega continua (CI/CD) para automatizar flujos de trabajo y optimizar entornos de producción.\n\nCuento con experiencia en el desarrollo de e-commerce completos, integración de pasarelas de pago, sistemas de autenticación y dashboards administrativos. Mi enfoque está centrado en el rendimiento, la seguridad, la escalabilidad y la aplicación de buenas prácticas de desarrollo.\n\nMe motiva seguir perfeccionando mis habilidades técnicas, optimizar procesos y construir soluciones digitales eficientes que aporten valor real a los proyectos en los que participo."
  },
  "softskills": {
    "title": "HABILIDADES BLANDAS",
    "description": "Como desarrollador full stack, considero que mis habilidades blandas más importantes son:",
    "data": [
      {
        "image": "Comunicacion",
        "title": "Comunicación",
        "text": "Me comunico de manera clara y efectiva con clientes y equipos de trabajo para asegurar alineación y colaboración eficiente."
      },
      {
        "image": "Colaboracion",
        "title": "Colaboración",
        "text": "Trabajo de forma colaborativa con desarrolladores, diseñadores y otros perfiles técnicos para lograr objetivos comunes."
      },
      {
        "image": "Adaptabilidad",
        "title": "Adaptabilidad",
        "text": "Me mantengo actualizado con nuevas tecnologías y me adapto rápidamente a entornos y requerimientos cambiantes."
      },
      {
        "image": "ResolucionProblemas",
        "title": "Resolución de problemas",
        "text": "Analizo desafíos técnicos con enfoque estructurado para encontrar soluciones eficientes y escalables."
      },
      {
        "image": "Liderazgo",
        "title": "Liderazgo",
        "text": "Asumo responsabilidad en proyectos y promuevo entornos de trabajo organizados y productivos."
      },
      {
        "image": "Organizacion",
        "title": "Organización",
        "text": "Gestiono tareas y prioridades de forma estructurada para cumplir objetivos y entregar resultados a tiempo."
      }
    ]
  },
  "techskills": {
    "title": "HABILIDADES TÉCNICAS",
    "description": "Experiencia sólida en tecnologías como JavaScript, TypeScript, React, Next.js, Node.js, Express, Redux, Sequelize, HTML, CSS y Tailwind. También manejo despliegues en Azure, automatización CI/CD y gestión de entornos productivos."
  },
  "contactme": {
    "title": "CONTÁCTAME",
    "description": "Si buscas un desarrollador full stack con experiencia en aplicaciones modernas, despliegues cloud y automatización CI/CD, estaré encantado de conversar contigo y aportar valor a tu proyecto.",
    "name": "NOMBRE",
    "email": "CORREO",
    "subject": "ASUNTO",
    "message": "MENSAJE",
    "errors": {
      "name": "Por favor ingresa tu nombre.",
      "email": "Por favor ingresa un email válido.",
      "subject": "Por favor ingresa el asunto del mensaje.",
      "message": "Por favor ingresa el texto del mensaje.",
      "minmessage": "El texto debe tener al menos 10 caracteres",
      "error": "Error, algo salió mal.",
      "minname": "El nombre debe tener al menos 3 caracteres"
    },
    "status": {
      "loading": "Enviando correo...",
      "success": "Correo enviado correctamente",
      "error": "Correo no enviado. Algo salió mal."
    }
  },
  "footer": {
    "text": "Junior Huanca. Todos los derechos reservados."
  }
}
