{
  "navbar": {
    "links": {
      "home": "Inicio",
      "aboutMe": "Conóceme",
      "softSkills": "Habilidades blandas",
      "techSkills": "Habilidades técnicas",
      "projects": "Proyectos",
      "contactMe": "Contáctame"
    },
    "languages": {
      "en": "Ingles",
      "es": "Español"
    },
    "mode": {
      "system": "Sistema",
      "light": "Claro",
      "dark": "Oscuro"
    }
  },
  "home": {
    "career": "Desarrollador Web Full-Stack",
    "introduction": "Soy un desarrollador web full-stack con experiencia en el desarrollo de aplicaciones utilizando React y Next.js. Mi enfoque se centra en construir soluciones web escalables y modernas, aprovechando mis habilidades tanto en el desarrollo frontend como en el backend.",
    "contactMe": "Contáctame",
    "donwload": "Descargar CV"
  },
  "aboutme": {
    "title": "CONOCEME",
    "description": "¡Hola! Soy Junior Huanca, un desarrollador web apasionado por crear experiencias digitales sorprendentes. Con experiencia en tecnologías como Next.js, JavaScript, TypeScript, React, Node.js y Express, puedo construir aplicaciones web robustas y escalables.\nTengo habilidades en el uso de bases de datos como MongoDB y PostgreSQL, lo que me permite gestionar eficientemente los datos y garantizar la integridad de la información.\nAdemás, tengo experiencia en el uso de Git y Bash para el control de versiones y automatización de tareas, lo que me ayuda a trabajar de manera más eficiente y garantizar una entrega de proyectos sin problemas.\nEstoy emocionado por enfrentar nuevos desafíos y aprender constantemente en este campo en evolución. Si buscas un desarrollador web apasionado y comprometido, ¡no dudes en contactarme! Estaré encantado de colaborar contigo en tu próximo proyecto."
  },
  "softskills": {
    "title": "HABILIDADES BLANDAS",
    "description": "Como desarrollador web full stack, considero que mis habilidades blandas más importantes son:",
    "data": [
      {
        "image": "Comunicacion",
        "title": "Comunicación",
        "text": "Me esfuerzo por comunicarme de manera clara y efectiva con clientes, colegas y superiores para garantizar una comprensión mutua y una colaboración efectiva."
      },
      {
        "image": "Colaboracion",
        "title": "Colaboración",
        "text": "Me gusta trabajar en equipo y colaborar con otros desarrolladores, diseñadores y profesionales de TI para lograr objetivos comunes."
      },
      {
        "image": "Adaptabilidad",
        "title": "Adaptabilidad",
        "text": "Me mantengo actualizado con las últimas tecnologías y tendencias en el desarrollo web y estoy dispuesto a aprender nuevas habilidades y tecnologías para satisfacer los requisitos cambiantes de los clientes."
      },
      {
        "image": "ResolucionProblemas",
        "title": "Resolución de problemas",
        "text": "Me considero un pensador analítico y estoy dispuesto a encontrar soluciones a los desafíos técnicos que surgen en el desarrollo web."
      },
      {
        "image": "Liderazgo",
        "title": "Liderazgo",
        "text": "Me esfuerzo por ser un líder motivador cuando lidero proyectos o equipos, y trato de fomentar un ambiente colaborativo y productivo."
      },
      {
        "image": "Organizacion",
        "title": "Organización",
        "text": "Me gusta mantener una visión general de mis proyectos y tareas y me esfuerzo por gestionar mi tiempo de manera efectiva para alcanzar mis objetivos y entregar proyectos a tiempo."
      }
    ]
  },
  "techskills": {
    "title": "HABILIDADES TÉCNICAS",
    "description": "Como desarrollador web con experiencia, tengo un fuerte conocimiento en tecnologías como JavaScript, React, Redux, Node JS, Express, Sequelize, HTML, CSS, NextJS, TypeScript y Tailwind y más. A continuación, encontrarás imágenes que representan mis habilidades y experiencia en estas áreas."
  },
  "projects": {
    "title": "PROYECTOS",
    "description": "Bienvenido a mi sección de Proyectos, donde podrás ver mis logros y capacidades como desarrollador web. Cada proyecto incluye una descripción detallada de las tareas que realicé, así como un enlace para que puedas ver el resultado final. Si estás interesado en trabajar conmigo en tu próximo proyecto, no dudes en contactarme.",
    "buttons": {
      "watch": "Ver proyecto",
      "repository": "Repositorio"
    },
    "data": [
      {
        "LaDionisia": {
          "description": "Vinoteca online con registro y acceso mediante email o cuenta de Google. Amplia selección de vinos filtrables y ordenables. Pago seguro con tarjeta de crédito o PayPal. Favoritos para productos deseados. Los usuarios pueden guardar productos en favoritos, y los administradores tienen acceso a un panel para editar y gestionar productos, así como ver estadísticas y usuarios registrados. Los usuarios pueden dejar reseñas y puntuaciones, que pueden ser reportadas y moderadas por los administradores."
        }
      },
      {
        "DigitalDreams": {
          "description": "Es un sitio web de comercio electrónico para tecnología e informática. El objetivo es ofrecer una plataforma conveniente para comprar productos de calidad en línea. Incluirá filtros de búsqueda avanzados, autenticación de terceros y una pasarela de pagos segura. Los clientes podrán explorar categorías, comparar productos, leer reseñas y comprar de manera segura. Se proporcionará autenticación de terceros para facilitar el registro y el acceso. En resumen, buscamos una experiencia de compra en línea conveniente y segura para los amantes de la tecnología."
        }
      }
    ]
  },
  "contactme": {
    "title": "CONTÁCTAME",
    "description": "Si están buscando un desarrollador web full-stack confiable, no dudes en contactarme. Estoy emocionado de conectarnos y ver cómo puedo aportar valor a tus proyectos. Juntos, podemos crear soluciones impactantes y hacer realidad tus ideas. ¡Espero hablar contigo pronto!",
    "name": "NOMBRE",
    "email": "CORREO",
    "subject": "ASUNTO",
    "message": "MENSAJE",
    "errors": {
      "name": "Por favor ingresa tu nombre.",
      "email": "Por favor ingresa un email válido.",
      "subject": "Por favor ingresa el asunto del mensaje.",
      "message": "Por favor ingresa el texto del mensaje.",
      "minmessage": "El texto debe tener al menos 10 caracteres",
      "error": "Error algo salió mal"
    },
    "status": {
      "loading": "Enviando correo...",
      "success": "Correo enviado correctamente",
      "error": "Correo no enviado. Algo salió mal."
    }
  },
  "footer": {
    "text": "JuniorHuanca. Todos los derechos reservados."
  }
}
